package com.doda.project555;

import android.content.SharedPreferences;
import android.content.SharedPreferences.Editor;
import android.database.SQLException;
import android.database.sqlite.SQLiteOpenHelper;
import android.database.sqlite.SQLiteDatabase;
import android.content.Context;

import static com.doda.project555.MainActivity.APP_PREFERENCES;

public class DatabaseHelper extends SQLiteOpenHelper {
    private static String DB_NAME = "TestDB.db";
    private static final int SCHEMA = 1; // версия базы данных
    final static public String TABLE = "\"Test DB\""; // название таблицы в бд
    // названия столбцов
    final static public String Num1 = "_id";
    final static public String Num2 = "№*";
    final static public String Num3 = "№**";
    final static public String name = "name";
    final static public String certificate = "certificate";
    final static public String typeOfReceipt = "type of receipt";
    final static public String math = "math";
    final static public String russian = "russian";
    final static public String phys = "phys";
    final static public String essay = "essay";
    final static public String IA = "IA";
    final static public String sum = "sum";
    SharedPreferences mySettings;

    public DatabaseHelper(Context context) {
        super(context, DB_NAME, null, SCHEMA);
    }

    @Override
    public void onCreate(SQLiteDatabase db) {
    }

    @Override
    public void onUpgrade(SQLiteDatabase db, int oldVersion,  int newVersion) {
    }

    public void create_db(Context context){
        final SharedPreferences mySettings = context.getSharedPreferences(APP_PREFERENCES, Context.MODE_PRIVATE);
        SQLiteDatabase db = context.openOrCreateDatabase("app.db", Context.MODE_PRIVATE, null);
        db.execSQL("CREATE TABLE IF NOT EXISTS \"Test DB\" (\n" +
                "\"_id\"INTEGER PRIMARY KEY AUTOINCREMENT,\n" +
                "\"№*\"INTEGER NOT NULL,\n" +
                "\"№**\"INTEGER NOT NULL,\n" +
                "\"name\"TEXT NOT NULL,\n" +
                "\"certificate\"TEXT NOT NULL,\n" +
                "\"type of receipt\"TEXT NOT NULL,\n" +
                "\"math\"INTEGER NOT NULL,\n" +
                "\"russian\"INTEGER NOT NULL,\n" +
                "\"phys\"INTEGER NOT NULL,\n" +
                "\"essay\"INTEGER NOT NULL,\n" +
                "\"IA\"INTEGER NOT NULL,\n" +
                "\"sum\"INTEGER NOT NULL\n" +
                ");");
        if(!mySettings.getBoolean("haveData", false)) {
            Editor ed = mySettings.edit();
            ed.putBoolean("haveData", true);
            ed.apply();
            db.execSQL("INSERT INTO \"Test DB\" VALUES ('1', '1', '1', 'Сартасова Надежда Евгеньевна', 'Копия', 'Целевое [Б]', '78', '96', '58', '0', '0', '232')," +
                    " ('2', '1', '2', 'Егоров Даниил Николаевич', 'Оригинал', 'Целевое [Б]', '74', '72', '70', '0', '0', '216')," +
                    " ('3', '2', '3', 'Квасова Валентина Олеговна', 'Копия', 'Целевое [Б]', '70', '80', '62', '0', '0', '212')," +
                    " ('4', '2', '4', 'Петров Александр Сергеевич', 'Копия', 'Целевое [Б]', '80', '70', '61', '0', '0', '211')," +
                    " ('5', '2', '4', 'Гаджиев Даниял Стефанович', 'Копия', 'Целевое [Б]', '76', '72', '57', '0', '0', '205')," +
                    " ('6', '2', '4', 'Какурина Елизавета Олеговна', 'Оригинал', 'Целевое [Б]', '70', '80', '54', '0', '0', '204')," +
                    " ('7', '3', '5', 'Скодтаев Эмир Викторович', 'Оригинал', 'Целевое [Б]', '72', '64', '55', '0', '0', '191')," +
                    " ('8', '4', '6', 'Панфилов Владислав Владимирович', 'Копия', 'Целевое [Б]', '62', '66', '59', '0', '0', '187')," +
                    " ('9', '4', '6', 'Шурекова Кристина Александровна', 'Копия', 'Целевое [Б]', '68', '76', '36', '0', '0', '180')," +
                    " ('10', '4', '6', 'Кирюшин Дмитрий Сергеевич', 'Оригинал', 'Целевое [Б]', '56', '65', '52', '0', '0', '173')," +
                    " ('11', '5', '7', 'Данилов Олег Алексеевич', 'Копия', 'Целевое [Б]', '62', '56', '44', '0', '0', '162')," +
                    " ('12', '5', '8', 'Шепелев Даниил Алексеевич', 'Оригинал', 'Целевое [Б]', '45', '50', '42', '0', '0', '137')," +
                    " ('13', '6', '9', 'Аксенов Никита Александрович', 'Копия', 'Целевое [Б]', '33', '54', '40', '0', '0', '127')," +
                    " ('14', '6', '10', 'Хуснуллин Евгений Альбертович', 'Копия', 'Целевое [Б]', '30', '0', '0', '0', '0', '30')," +
                    " ('15', '6', '11', 'Сыромля Евгений Геннадьевич', 'Копия', 'Квота [Б]', '76', '100', '84', '0', '0', '260')," +
                    " ('16', '6', '11', 'Федулов Василий Юрьевич', 'Копия', 'Квота [Б]', '76', '89', '70', '0', '0', '235')," +
                    " ('17', '6', '12', 'Аверкиев Петр Васильевич', 'Копия', 'Квота [Б]', '72', '85', '68', '0', '0', '225')," +
                    " ('18', '6', '13', 'Сигусов Виталий Алексеевич', 'Копия', 'Квота [Б]', '74', '70', '74', '0', '7', '225')," +
                    " ('19', '6', '14', 'Машоха Сергей Алексеевич', 'Копия', 'Квота [Б]', '76', '76', '66', '0', '3', '221')," +
                    " ('20', '6', '15', 'Барков Михаил Андреевич', 'Копия', 'Квота [Б]', '74', '80', '66', '0', '0', '220')," +
                    " ('21', '6', '16', 'Брызгалов Дмитрий Ильич', 'Копия', 'Квота [Б]', '74', '87', '59', '0', '0', '220')," +
                    " ('22', '6', '17', 'Булава Всеволод Викторович', 'Копия', 'Квота [Б]', '76', '76', '68', '0', '0', '220')," +
                    " ('23', '6', '18', 'Поляков Артем Юрьевич', 'Копия', 'Квота [Б]', '82', '61', '76', '0', '0', '219')," +
                    " ('24', '6', '19', 'Троицкая Александра Евгеньевна', 'Копия', 'Квота [Б]', '68', '89', '59', '0', '0', '216')," +
                    " ('25', '6', '19', 'Черноплеков Александр Сергеевич', 'Копия', 'Квота [Б]', '72', '65', '72', '0', '3', '212')," +
                    " ('26', '6', '20', 'Акименков Артем Андреевич', 'Копия', 'Квота [Б]', '70', '80', '60', '0', '0', '210')," +
                    " ('27', '6', '21', 'Корнеев Даниил Сергеевич', 'Копия', 'Квота [Б]', '74', '67', '62', '0', '0', '203')," +
                    " ('28', '6', '22', 'Ланин Олег Викторович', 'Копия', 'Квота [Б]', '62', '71', '57', '0', '10', '200')," +
                    " ('29', '6', '22', 'Комаров Алексей Вадимович', 'Копия', 'Квота [Б]', '70', '69', '60', '0', '0', '199')," +
                    " ('30', '6', '23', 'Таршхоев Амир Идрисович', 'Копия', 'Квота [Б]', '50', '76', '57', '0', '0', '183')," +
                    " ('31', '6', '23', 'Таршхоев Амир Идрисович', 'Копия', 'Квота [Б]', '50', '76', '57', '0', '0', '183')," +
                    " ('32', '6', '25', 'Музаев Номинхан Андреевич', 'Копия', 'Квота [Б]', '62', '76', '41', '0', '0', '179')," +
                    " ('33', '6', '26', 'Заморин Илья Артемович', 'Копия', 'Квота [Б]', '50', '67', '53', '0', '0', '170')," +
                    " ('34', '6', '27', 'Салуев Евгений Алексеевич', 'Копия', 'Квота [Б]', '45', '60', '53', '0', '10', '168')," +
                    " ('35', '6', '28', 'Аллахвердов Артем Григорьевич', 'Копия', 'Квота [Б]', '50', '60', '51', '0', '0', '161')," +
                    " ('36', '6', '29', 'Игнатенко Денис Анатольевич', 'Копия', 'Квота [Б]', '33', '66', '46', '0', '0', '145')," +
                    " ('37', '6', '30', 'Минеев Евгений Дмитриевич', 'Копия', 'Квота [Б]', '27', '64', '46', '0', '0', '137')," +
                    " ('38', '6', '31', 'Золотухин Святослав Александрович', 'Копия', 'Квота [Б]', '75', '0', '0', '0', '10', '85')," +
                    " ('39', '6', '32', 'Хуснулин Руслан Гемерович', 'Копия', 'Квота [Б]', '45', '0', '39', '0', '0', '84')," +
                    " ('40', '6', '33', 'Джемалиев Рустам Маратович', 'Копия', 'Квота [Б]', '27', '0', '0', '0', '10', '37')," +
                    " ('41', '6', '34', 'Александров Павел Сергеевич', 'Копия', 'ОК [Б]', '99', '89', '98', '0', '10', '296')," +
                    " ('42', '6', '34', 'Волгина Анна Денисовна', 'Копия', 'ОК [Б]', '94', '98', '90', '0', '10', '292')," +
                    " ('43', '6', '35', 'Петухова Мария Геннадьевна', 'Копия', 'ОК [Б]', '98', '96', '96', '0', '0', '290')," +
                    " ('44', '6', '35', 'Тимченко Александр Александрович', 'Оригинал', 'ОК [Б]', '98', '98', '94', '0', '0', '290')," +
                    " ('45', '7', '36', 'Шухнова Ирина Сергеевна', 'Копия', 'ОК [Б]', '86', '100', '94', '0', '10', '290')," +
                    " ('46', '7', '37', 'Большаков Никита Сергеевич', 'Копия', 'ОК [Б]', '94', '87', '96', '0', '10', '287')," +
                    " ('47', '7', '37', 'Лазарева Юлия Валерьевна', 'Копия', 'ОК [Б]', '86', '100', '88', '0', '10', '284')," +
                    " ('48', '7', '38', 'Ульянова Оксана Анатольевна', 'Копия', 'ОК [Б]', '94', '96', '94', '0', '0', '284')," +
                    " ('49', '7', '39', 'Шипелев Антон Андреевич', 'Копия', 'ОК [Б]', '94', '87', '92', '0', '10', '283')," +
                    " ('50', '7', '40', 'Петрин Герман Сергеевич', 'Копия', 'ОК [Б]', '92', '87', '96', '0', '7', '282')," +
                    " ('51', '7', '40', 'Галманов Павел Александрович', 'Копия', 'ОК [Б]', '99', '78', '94', '0', '10', '281')," +
                    " ('52', '7', '40', 'Князев Егор Иванович', 'Копия', 'ОК [Б]', '98', '85', '98', '0', '0', '281')," +
                    " ('53', '7', '41', 'Соколовская Карина Евгеньевна', 'Копия', 'ОК [Б]', '94', '96', '86', '0', '5', '281')," +
                    " ('54', '7', '42', 'Воробьев Евгений Романович', 'Копия', 'ОК [Б]', '88', '98', '94', '0', '0', '280')," +
                    " ('55', '7', '43', 'Зиновенков Михаил Викторович', 'Копия', 'ОК [Б]', '88', '94', '90', '0', '7', '279')," +
                    " ('56', '7', '44', 'Серегин Михаил Сергеевич', 'Копия', 'ОК [Б]', '99', '93', '87', '0', '0', '279')," +
                    " ('57', '7', '45', 'Сосунов Алексей Михайлович', 'Копия', 'ОК [Б]', '92', '89', '88', '0', '10', '279')," +
                    " ('58', '7', '46', 'Бацаев Владислав Павлович', 'Копия', 'ОК [Б]', '84', '98', '96', '0', '0', '278')," +
                    " ('59', '7', '47', 'Рамазанов Никита Максимович', 'Копия', 'ОК [Б]', '96', '100', '82', '0', '0', '278')," +
                    " ('60', '7', '48', 'Руденко Катерина Дмитриевна', 'Копия', 'ОК [Б]', '92', '94', '82', '0', '10', '278')," +
                    " ('61', '7', '49', 'Гамидов Шамсудин Селимханович', 'Копия', 'ОК [Б]', '82', '91', '94', '0', '10', '277')," +
                    " ('62', '7', '50', 'Елисеенко Андрей Михайлович', 'Копия', 'ОК [Б]', '96', '89', '92', '0', '0', '277')," +
                    " ('63', '7', '51', 'Покидова Алина Юрьевна', 'Копия', 'ОК [Б]', '82', '89', '96', '0', '10', '277')," +
                    " ('64', '7', '52', 'Сырцев Ярослав Романович', 'Копия', 'ОК [Б]', '88', '89', '90', '0', '10', '277')," +
                    " ('65', '7', '53', 'Трофименко Алексей Михайлович', 'Копия', 'ОК [Б]', '90', '89', '98', '0', '0', '277')," +
                    " ('66', '7', '54', 'Галяутдинов Рамиль Саматович', 'Копия', 'ОК [Б]', '94', '78', '94', '0', '10', '276')," +
                    " ('67', '7', '55', 'Лебедь Александр Иванович', 'Копия', 'ОК [Б]', '86', '96', '94', '0', '0', '276')," +
                    " ('68', '7', '56', 'Филиппов Евгений Иванович', 'Копия', 'ОК [Б]', '88', '96', '82', '0', '10', '276')," +
                    " ('69', '7', '57', 'Шевченко Билал Сергеевич', 'Копия', 'ОК [Б]', '99', '89', '88', '0', '0', '276')," +
                    " ('70', '7', '57', 'Беляев Иван Игоревич', 'Копия', 'ОК [Б]', '86', '86', '92', '0', '10', '274')," +
                    " ('71', '7', '58', 'Глебкин Кирилл Сергеевич', 'Копия', 'ОК [Б]', '84', '96', '84', '0', '10', '274')," +
                    " ('72', '7', '58', 'Данилова Мария Александровна', 'Копия', 'ОК [Б]', '80', '94', '90', '0', '10', '274')," +
                    " ('73', '7', '58', 'Корольков Максим Дмитриевич', 'Копия', 'ОК [Б]', '92', '93', '89', '0', '0', '274')," +
                    " ('74', '7', '59', 'Осипова Анастасия Андреевна', 'Копия', 'ОК [Б]', '82', '96', '96', '0', '0', '274')," +
                    " ('75', '7', '59', 'Максимова Маргарита Александровна', 'Копия', 'ОК [Б]', '88', '91', '94', '0', '0', '273')," +
                    " ('76', '7', '60', 'Базалеев Федор Евгеньевич', 'Копия', 'ОК [Б]', '99', '85', '88', '0', '0', '272')," +
                    " ('77', '7', '61', 'Максимова Екатерина Алексеевна', 'Копия', 'ОК [Б]', '84', '96', '82', '0', '10', '272')," +
                    " ('78', '7', '62', 'Сысоев Сергей Алексеевич', 'Копия', 'ОК [Б]', '78', '98', '96', '0', '0', '272')," +
                    " ('79', '7', '63', 'Барминов Дмитрий Александрович', 'Копия', 'ОК [Б]', '94', '80', '90', '0', '7', '271')," +
                    " ('80', '7', '63', 'Богдашкин Дмитрий Сергеевич', 'Копия', 'ОК [Б]', '90', '87', '84', '0', '10', '271')," +
                    " ('81', '7', '64', 'Игошин Данил Игоревич', 'Копия', 'ОК [Б]', '86', '91', '84', '0', '10', '271')," +
                    " ('82', '7', '65', 'Колесников Вадим Вячеславович', 'Копия', 'ОК [Б]', '82', '87', '92', '0', '10', '271')," +
                    " ('83', '7', '66', 'Михайлов Сергей Александрович', 'Копия', 'ОК [Б]', '84', '91', '86', '0', '10', '271')," +
                    " ('84', '7', '67', 'Надеев Иван Дмитриевич', 'Копия', 'ОК [Б]', '100', '85', '86', '0', '0', '271')," +
                    " ('85', '7', '67', 'Никитин Леонид Сергеевич', 'Копия', 'ОК [Б]', '96', '85', '90', '0', '0', '271')," +
                    " ('86', '7', '68', 'Носов Арсений Юрьевич', 'Копия', 'ОК [Б]', '98', '87', '86', '0', '0', '271')," +
                    " ('87', '7', '69', 'Володова Елизавета Сергеевна', 'Копия', 'ОК [Б]', '86', '98', '86', '0', '0', '270')," +
                    " ('88', '7', '70', 'Калмыкова Мария Алексеевна', 'Копия', 'ОК [Б]', '90', '82', '98', '0', '0', '270')," +
                    " ('89', '7', '71', 'Никифорова Софья Григорьевна', 'Копия', 'ОК [Б]', '94', '94', '72', '0', '10', '270')," +
                    " ('90', '7', '71', 'Плотников Алексей Евгеньевич', 'Копия', 'ОК [Б]', '82', '96', '82', '0', '10', '270')," +
                    " ('91', '7', '72', 'Простоквашин Вадим Александрович', 'Копия', 'ОК [Б]', '82', '94', '94', '0', '0', '270')," +
                    " ('92', '7', '72', 'Шутяк Александр Юрьевич', 'Копия', 'ОК [Б]', '92', '91', '82', '0', '5', '270')," +
                    " ('93', '7', '73', 'Мухаметдинов Даниил Фанилевич', 'Копия', 'ОК [Б]', '90', '85', '94', '0', '0', '269')," +
                    " ('94', '7', '73', 'Савченко Илья Владимирович', 'Копия', 'ОК [Б]', '92', '87', '90', '0', '0', '269')," +
                    " ('95', '7', '74', 'Самаров Вадим Геннадьевич', 'Копия', 'ОК [Б]', '94', '89', '76', '0', '10', '269')," +
                    " ('96', '7', '75', 'Трохова Анжела Николаевна', 'Копия', 'ОК [Б]', '76', '91', '92', '0', '10', '269')," +
                    " ('97', '7', '76', 'Хотин Николай Аркадьевич', 'Копия', 'ОК [Б]', '96', '91', '82', '0', '0', '269')," +
                    " ('98', '7', '77', 'Бацеко Ирина Владимировна', 'Копия', 'ОК [Б]', '96', '80', '82', '0', '10', '268')," +
                    " ('99', '7', '77', 'Горюнов Руслан Олегович', 'Копия', 'ОК [Б]', '74', '94', '90', '0', '10', '268')," +
                    " ('100', '7', '78', 'Гридина Алена Николаевна', 'Копия', 'ОК [Б]', '82', '100', '76', '0', '10', '268');");
        }
    }

    public SQLiteDatabase open(Context context)throws SQLException {

        return SQLiteDatabase.openDatabase(String.valueOf(context.getDatabasePath("app.db")), null, SQLiteDatabase.OPEN_READWRITE);
    }
}
